{
    "Salary": [
        "Architectural & Engineering Managers",
        "Aerospace Engineers",
        "Anesthesiologist Assistants",
        "Astronomers",
        "Actuaries",
        "Administrative Services Managers",
        "Bioengineers & Biomedical Engineers",
        "Biochemists & Biophysicists",
        "Automotive Engineers",
        "Atmospheric & Space Scientists",
        "Architects",
        "Agents & Business Managers of Artists, Performers, & Athletes",
        "Acute Care Nurses",
        "Advanced Practice Psychiatric Nurses",
        "Bioinformatics Scientists",
        "Audiologists",
        "Agricultural Engineers",
        "Accountants & Auditors",
        "Avionics Technicians",
        "Aerospace Engineering & Operations Technologists & Technicians",
        "Animal Scientists",
        "Acupuncturists",
        "Bioinformatics Technicians",
        "Arbitrators, Mediators, & Conciliators",
        "Art Therapists",
        "Anthropologists & Archeologists",
        "Aircraft Cargo Handling Supervisors",
        "Athletes & Sports Competitors",
        "Archivists",
        "Athletic Trainers",
        "Agricultural Technicians",
        "Agricultural Equipment Operators",
        "Aircraft Service Attendants",
        "Bicycle Repairers",
        "Barbers",
        "Animal Trainers",
        "Bartenders",
        "Animal Caretakers",
        "Baristas"
    ],
    "Edu": [
        "Architectural & Engineering Managers",
        "Architects",
        "Animal Scientists",
        "Biochemists & Biophysicists",
        "Bioinformatics Scientists",
        "Astronomers",
        "Anthropologists & Archeologists",
        "Arbitrators, Mediators, & Conciliators",
        "Archivists",
        "Anesthesiologist Assistants",
        "Art Therapists",
        "Advanced Practice Psychiatric Nurses",
        "Audiologists",
        "Acupuncturists",
        "Athletic Trainers",
        "Agents & Business Managers of Artists, Performers, & Athletes",
        "Accountants & Auditors",
        "Actuaries",
        "Bioinformatics Technicians",
        "Aerospace Engineers",
        "Agricultural Engineers",
        "Bioengineers & Biomedical Engineers",
        "Automotive Engineers",
        "Atmospheric & Space Scientists",
        "Administrative Services Managers",
        "Aerospace Engineering & Operations Technologists & Technicians",
        "Agricultural Technicians",
        "Acute Care Nurses",
        "Barbers",
        "Avionics Technicians",
        "Athletes & Sports Competitors",
        "Bartenders",
        "Animal Trainers",
        "Animal Caretakers",
        "Bicycle Repairers",
        "Aircraft Cargo Handling Supervisors",
        "Aircraft Service Attendants",
        "Baristas",
        "Agricultural Equipment Operators"
    ],
    "BigData": {
        "Administrative Services Managers": {
            "Description:": "Plan, direct, or coordinate one or more administrative services of an organization, such as records and information management, mail distribution, and other office support services.",
            "Salary:": 108390,
            "Prep:": 3,
            "Education:": [
                "high school diploma/GED",
                "bachelor's degree"
            ],
            "Code:": "11-3012.00"
        },
        "Architectural & Engineering Managers": {
            "Description:": "Plan, direct, or coordinate activities in such fields as architecture and engineering or research and development in these fields.",
            "Salary:": 167740,
            "Prep:": 5,
            "Education:": [
                "bachelor's degree",
                "master's degree"
            ],
            "Code:": "11-9041.00"
        },
        "Agents & Business Managers of Artists, Performers, & Athletes": {
            "Description:": "Represent and promote artists, performers, and athletes in dealings with current or prospective employers. May handle contract negotiation and other business matters for clients.",
            "Salary:": 96310,
            "Prep:": 4,
            "Education:": [
                "bachelor's degree",
                "high school diploma/GED"
            ],
            "Code:": "13-1011.00"
        },
        "Accountants & Auditors": {
            "Description:": "Examine, analyze, and interpret accounting records to prepare financial statements, give advice, or audit and evaluate statements prepared by others. Install or advise on systems of recording costs or other financial and budgetary data.",
            "Salary:": 81680,
            "Prep:": 4,
            "Education:": null,
            "Code:": "13-2011.00"
        },
        "Actuaries": {
            "Description:": "Analyze statistical data, such as mortality, accident, sickness, disability, and retirement rates and construct probability tables to forecast risk and liability for payment of future benefits. May ascertain insurance rates required and cash reserves necessary to ensure payment of future benefits.",
            "Salary:": 125770,
            "Prep:": 4,
            "Education:": [
                "bachelor's degree",
                "certificate after college"
            ],
            "Code:": "15-2011.00"
        },
        "Bioinformatics Technicians": {
            "Description:": "Apply principles and methods of bioinformatics to assist scientists in areas such as pharmaceuticals, medical technology, biotechnology, computational biology, proteomics, computer information science, biology and medical informatics. Apply bioinformatics tools to visualize, analyze, manipulate or interpret molecular data. May build and maintain databases for processing and analyzing genomic or other biological information.",
            "Salary:": 71490,
            "Prep:": 4,
            "Education:": [
                "bachelor's degree",
                "master's degree"
            ],
            "Code:": "15-2099.01"
        },
        "Architects": {
            "Description:": "Plan and design structures, such as private residences, office buildings, theaters, factories, and other structural property.",
            "Salary:": 96690,
            "Prep:": 5,
            "Education:": [
                "bachelor's degree",
                "master's degree"
            ],
            "Code:": "17-1011.00"
        },
        "Aerospace Engineers": {
            "Description:": "Perform engineering duties in designing, constructing, and testing aircraft, missiles, and spacecraft. May conduct basic and applied research to evaluate adaptability of materials and equipment to aircraft design and manufacture. May recommend improvements in testing equipment and techniques.",
            "Salary:": 134830,
            "Prep:": 4,
            "Education:": [
                "bachelor's degree",
                "master's degree"
            ],
            "Code:": "17-2011.00"
        },
        "Agricultural Engineers": {
            "Description:": "Apply knowledge of engineering technology and biological science to agricultural problems concerned with power and machinery, electrification, structures, soil and water conservation, and processing of agricultural products.",
            "Salary:": 84630,
            "Prep:": 4,
            "Education:": [
                "bachelor's degree"
            ],
            "Code:": "17-2021.00"
        },
        "Bioengineers & Biomedical Engineers": {
            "Description:": "Apply knowledge of engineering, biology, chemistry, computer science, and biomechanical principles to the design, development, and evaluation of biological, agricultural, and health systems and products, such as artificial organs, prostheses, instrumentation, medical information systems, and health management and care delivery systems.",
            "Salary:": 106950,
            "Prep:": 4,
            "Education:": [
                "bachelor's degree",
                "master's degree"
            ],
            "Code:": "17-2031.00"
        },
        "Automotive Engineers": {
            "Description:": "Develop new or improved designs for vehicle structural members, engines, transmissions, or other vehicle systems, using computer-assisted design technology. Direct building, modification, or testing of vehicle or components.",
            "Salary:": 102320,
            "Prep:": 4,
            "Education:": [
                "bachelor's degree",
                "master's degree"
            ],
            "Code:": "17-2141.02"
        },
        "Aerospace Engineering & Operations Technologists & Technicians": {
            "Description:": "Operate, install, adjust, and maintain integrated computer/communications systems, consoles, simulators, and other data acquisition, test, and measurement instruments and equipment, which are used to launch, track, position, and evaluate air and space vehicles. May record and interpret test data.",
            "Salary:": 79830,
            "Prep:": 3,
            "Education:": [
                "certificate after high school",
                "associate's degree"
            ],
            "Code:": "17-3021.00"
        },
        "Animal Scientists": {
            "Description:": "Conduct research in the genetics, nutrition, reproduction, growth, and development of domestic farm animals.",
            "Salary:": 79120,
            "Prep:": 5,
            "Education:": [
                "doctoral degree",
                "master's degree"
            ],
            "Code:": "19-1011.00"
        },
        "Biochemists & Biophysicists": {
            "Description:": "Study the chemical composition or physical principles of living cells and organisms, their electrical and mechanical energy, and related phenomena. May conduct research to further understanding of the complex chemical combinations and reactions involved in metabolism, reproduction, growth, and heredity. May determine the effects of foods, drugs, serums, hormones, and other substances on tissues and vital processes of living organisms.",
            "Salary:": 103650,
            "Prep:": 5,
            "Education:": [
                "post-doctoral training",
                "doctoral degree"
            ],
            "Code:": "19-1021.00"
        },
        "Bioinformatics Scientists": {
            "Description:": "Conduct research using bioinformatics theory and methods in areas such as pharmaceuticals, medical technology, biotechnology, computational biology, proteomics, computer information science, biology and medical informatics. May design databases and develop algorithms for processing and analyzing genomic information, or other biological information.",
            "Salary:": 93330,
            "Prep:": 5,
            "Education:": [
                "bachelor's degree",
                "post-doctoral training"
            ],
            "Code:": "19-1029.01"
        },
        "Astronomers": {
            "Description:": "Observe, research, and interpret astronomical phenomena to increase basic knowledge or apply such information to practical problems.",
            "Salary:": 132170,
            "Prep:": 5,
            "Education:": [
                "doctoral degree",
                "post-doctoral training"
            ],
            "Code:": "19-2011.00"
        },
        "Atmospheric & Space Scientists": {
            "Description:": "Investigate atmospheric phenomena and interpret meteorological data, gathered by surface and air stations, satellites, and radar to prepare reports and forecasts for public and other uses. Includes weather analysts and forecasters whose functions require the detailed knowledge of meteorology.",
            "Salary:": 97450,
            "Prep:": 4,
            "Education:": [
                "bachelor's degree",
                "master's degree"
            ],
            "Code:": "19-2021.00"
        },
        "Anthropologists & Archeologists": {
            "Description:": "Study the origin, development, and behavior of human beings. May study the way of life, language, or physical characteristics of people in various parts of the world. May engage in systematic recovery and examination of material evidence, such as tools or pottery remaining from past human cultures, in order to determine the history, customs, and living habits of earlier civilizations.",
            "Salary:": 64910,
            "Prep:": 5,
            "Education:": [
                "doctoral degree",
                "master's degree"
            ],
            "Code:": "19-3091.00"
        },
        "Agricultural Technicians": {
            "Description:": "Work with agricultural scientists in plant, fiber, and animal research, or assist with animal breeding and nutrition. Set up or maintain laboratory equipment and collect samples from crops or animals. Prepare specimens or record data to assist scientists in biology or related life science experiments. Conduct tests and experiments to improve yield and quality of crops or to increase the resistance of plants and animals to disease or insects.",
            "Salary:": 46790,
            "Prep:": 3,
            "Education:": [
                "high school diploma/GED",
                "bachelor's degree"
            ],
            "Code:": "19-4012.00"
        },
        "Arbitrators, Mediators, & Conciliators": {
            "Description:": "Facilitate negotiation and conflict resolution through dialogue. Resolve conflicts outside of the court system by mutual consent of parties involved.",
            "Salary:": 67710,
            "Prep:": 5,
            "Education:": [
                "professional degree",
                "bachelor's degree"
            ],
            "Code:": "23-1022.00"
        },
        "Archivists": {
            "Description:": "Appraise, edit, and direct safekeeping of permanent records and historically valuable documents. Participate in research activities based on archival materials.",
            "Salary:": 61570,
            "Prep:": 5,
            "Education:": [
                "master's degree"
            ],
            "Code:": "25-4011.00"
        },
        "Athletes & Sports Competitors": {
            "Description:": "Compete in athletic events.",
            "Salary:": 62360,
            "Prep:": 2,
            "Education:": [
                "no high school diploma/GED",
                "bachelor's degree"
            ],
            "Code:": "27-2021.00"
        },
        "Anesthesiologist Assistants": {
            "Description:": "Assist anesthesiologists in the administration of anesthesia for surgical and non-surgical procedures. Monitor patient status and provide patient care during surgical treatment.",
            "Salary:": 133260,
            "Prep:": 5,
            "Education:": [
                "master's degree",
                "high school diploma/GED"
            ],
            "Code:": "29-1071.01"
        },
        "Art Therapists": {
            "Description:": "Plan or conduct art therapy sessions or programs to improve clients' physical, cognitive, or emotional well-being.",
            "Salary:": 65010,
            "Prep:": 5,
            "Education:": [
                "master's degree"
            ],
            "Code:": "29-1129.01"
        },
        "Acute Care Nurses": {
            "Description:": "Provide advanced nursing care for patients with acute conditions such as heart attacks, respiratory distress syndrome, or shock. May care for pre- and post-operative patients or perform advanced, invasive diagnostic or therapeutic procedures.",
            "Salary:": 93600,
            "Prep:": 3,
            "Education:": [
                "associate's degree",
                "bachelor's degree"
            ],
            "Code:": "29-1141.01"
        },
        "Advanced Practice Psychiatric Nurses": {
            "Description:": "Assess, diagnose, and treat individuals and families with mental health or substance use disorders or the potential for such disorders. Apply therapeutic activities, including the prescription of medication, per state regulations, and the administration of psychotherapy.",
            "Salary:": 93600,
            "Prep:": 5,
            "Education:": [
                "master's degree"
            ],
            "Code:": "29-1141.02"
        },
        "Audiologists": {
            "Description:": "Assess and treat persons with hearing and related disorders. May fit hearing aids and provide auditory training. May perform research related to hearing problems.",
            "Salary:": 92120,
            "Prep:": 5,
            "Education:": [
                "doctoral degree"
            ],
            "Code:": "29-1181.00"
        },
        "Acupuncturists": {
            "Description:": "Diagnose, treat, and prevent disorders by stimulating specific acupuncture points within the body using acupuncture needles. May also use cups, nutritional supplements, therapeutic massage, acupressure, and other alternative health therapies.",
            "Salary:": 78140,
            "Prep:": 5,
            "Education:": [
                "master's degree",
                "professional degree"
            ],
            "Code:": "29-1291.00"
        },
        "Athletic Trainers": {
            "Description:": "Evaluate and treat musculoskeletal injuries or illnesses. Provide preventive, therapeutic, emergency, and rehabilitative care.",
            "Salary:": 60250,
            "Prep:": 5,
            "Education:": [
                "master's degree",
                "bachelor's degree"
            ],
            "Code:": "29-9091.00"
        },
        "Bartenders": {
            "Description:": "Mix and serve drinks to patrons, directly or through waitstaff.",
            "Salary:": 33530,
            "Prep:": 2,
            "Education:": [
                "high school diploma/GED",
                "no high school diploma/GED"
            ],
            "Code:": "35-3011.00"
        },
        "Baristas": {
            "Description:": "Prepare or serve specialty coffee or other beverages. Serve food such as baked goods or sandwiches to patrons.",
            "Salary:": 30480,
            "Prep:": 1,
            "Education:": [
                "no high school diploma/GED",
                "high school diploma/GED"
            ],
            "Code:": "35-3023.01"
        },
        "Animal Trainers": {
            "Description:": "Train animals for riding, harness, security, performance, or obedience, or for assisting persons with disabilities. Accustom animals to human voice and contact, and condition animals to respond to commands. Train animals according to prescribed standards for show or competition. May train animals to carry pack loads or work as part of pack team.",
            "Salary:": 38750,
            "Prep:": 2,
            "Education:": [
                "high school diploma/GED",
                "no high school diploma/GED"
            ],
            "Code:": "39-2011.00"
        },
        "Animal Caretakers": {
            "Description:": "Feed, water, groom, bathe, exercise, or otherwise provide care to promote and maintain the well-being of pets and other animals that are not raised for consumption, such as dogs, cats, race horses, ornamental fish or birds, zoo animals, and mice. Work in settings such as kennels, animal shelters, zoos, circuses, and aquariums. May keep records of feedings, treatments, and animals received or discharged. May clean, disinfect, and repair cages, pens, or fish tanks.",
            "Salary:": 33470,
            "Prep:": 2,
            "Education:": [
                "high school diploma/GED",
                "associate's degree"
            ],
            "Code:": "39-2021.00"
        },
        "Barbers": {
            "Description:": "Provide barbering services, such as cutting, trimming, shampooing, and styling hair; trimming beards; or giving shaves.",
            "Salary:": 38960,
            "Prep:": 3,
            "Education:": [
                "certificate after high school",
                "high school diploma/GED"
            ],
            "Code:": "39-5011.00"
        },
        "Agricultural Equipment Operators": {
            "Description:": "Drive and control equipment to support agricultural activities such as tilling soil; planting, cultivating, and harvesting crops; feeding and herding livestock; or removing animal waste. May perform tasks such as crop baling or hay bucking. May operate stationary equipment to perform post-harvest tasks such as husking, shelling, threshing, and ginning.",
            "Salary:": 42580,
            "Prep:": 1,
            "Education:": [
                "no high school diploma/GED",
                "high school diploma/GED"
            ],
            "Code:": "45-2091.00"
        },
        "Avionics Technicians": {
            "Description:": "Install, inspect, test, adjust, or repair avionics equipment, such as radar, radio, navigation, and missile control systems in aircraft or space vehicles.",
            "Salary:": 81390,
            "Prep:": 3,
            "Education:": [
                "certificate after high school",
                "high school diploma/GED"
            ],
            "Code:": "49-2091.00"
        },
        "Bicycle Repairers": {
            "Description:": "Repair and service bicycles.",
            "Salary:": 40360,
            "Prep:": 2,
            "Education:": [
                "no high school diploma/GED",
                "high school diploma/GED"
            ],
            "Code:": "49-3091.00"
        },
        "Aircraft Cargo Handling Supervisors": {
            "Description:": "Supervise and coordinate the activities of ground crew in the loading, unloading, securing, and staging of aircraft cargo or baggage. May determine the quantity and orientation of cargo and compute aircraft center of gravity. May accompany aircraft as member of flight crew and monitor and handle cargo in flight, and assist and brief passengers on safety and emergency procedures. Includes loadmasters.",
            "Salary:": 63940,
            "Prep:": 2,
            "Education:": [
                "high school diploma/GED",
                "bachelor's degree"
            ],
            "Code:": "53-1041.00"
        },
        "Aircraft Service Attendants": {
            "Description:": "Service aircraft with fuel. May de-ice aircraft, refill water and cooling agents, empty sewage tanks, service air and oxygen systems, or clean and polish exterior.",
            "Salary:": 41540,
            "Prep:": 2,
            "Education:": null,
            "Code:": "53-6032.00"
        }
    }
}